---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricArea.GetReinforcementRoundingManager
source: html/6dc448b9-1be0-95f7-a38d-c540a440c5e3.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.GetReinforcementRoundingManager Method

Returns an object for managing reinforcement rounding override settings.

## Syntax (C#)
```csharp
public FabricRoundingManager GetReinforcementRoundingManager()
```

## Returns
The rounding manager.